# Дано натуральное число. Выведите его последнюю цифру.

# Формат ввода

# Вводится единственное целое положительное число (гарантируется, что оно не превышает 10000).

N = int(input())

print(N % 10)
