# Дано положительное двузначное число. Найдите число десятков в нем.

# Формат ввода

# Вводится единственное число (гарантируется, что оно соответствует условию задачи).

N = int(input())

print(N // 10)
